lambda/src/test/resources/model/AmendmentHandlerHelperTest/1761090945067/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 8,
  "revision": "14.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2021-09-28",
  "serviceActivationDate": "2021-09-28",
  "customerAcceptanceDate": "2021-09-28",
  "subscriptionStartDate": "2021-09-28",
  "subscriptionEndDate": "2027-05-23",
  "lastBookingDate": "2025-10-21",
  "termStartDate": "2026-05-23",
  "termEndDate": "2027-05-23",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 12.0,
  "totalContractedValue": 491.5,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "f70ce31c-cda3-06b4-0000-00000000ac1a",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "Ireland"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a128d8c99f14124019a0932487e6ed0",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "8a1299c28fb956e8018fe2c0e12c3ae4",
      "productRatePlanNumber": "PRP-00000199",
      "ratePlanName": "Cancellation Save Discount - Free for 2 months",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05617051",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128d8c99f14124019a093248816ed2",
          "originalChargeId": "8a128bb1918782f6019188eb712213eb",
          "productRatePlanChargeId": "8a1295998fb956ea018fe2c19df341b9",
          "number": "C-05845422",
          "name": "Cancellation Save Discount - Free for 2 months",
          "productRatePlanChargeNumber": "PRPC-00000318",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 0.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-09-23",
          "effectiveEndDate": "2024-11-23",
          "processedThroughDate": "2024-10-23",
          "chargedThroughDate": "2024-11-23",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 2,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-08-25",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "100%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 100.0
        }
      ]
    },
    {
      "id": "8a128d8c99f14124019a093248836ed5",
      "lastChangeType": "Remove",
      "productId": "2c92a0fe5aacfabe015ad24bf6e15ff6",
      "productName": "Contributor",
      "productSku": "ABC-00000028",
      "productRatePlanId": "2c92a0fc5aacfadd015ad24db4ff5e97",
      "productRatePlanNumber": null,
      "ratePlanName": "Monthly Contribution",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-03167256",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128d8c99f14124019a093248856ed7",
          "originalChargeId": "2c92a0fe7c1b013f017c2b79748d56ca",
          "productRatePlanChargeId": "2c92a0fc5aacfadd015ad250bf2c6d38",
          "number": "C-03167256",
          "name": "Monthly Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-09-28",
          "effectiveEndDate": "2024-05-23",
          "processedThroughDate": "2024-05-23",
          "chargedThroughDate": "2024-05-23",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 3.0,
          "dmrc": 0.0,
          "tcv": 95.499999999,
          "dtcv": -12.500000001,
          "originalOrderDate": "2021-09-28",
          "amendedByOrderOn": "2024-05-23",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 3.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP3",
          "price": 3.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128d8c99f14124019a093248886eda",
      "lastChangeType": "Remove",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": "PRP-00000180",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05370668",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128d8c99f14124019a0932488a6ede",
          "originalChargeId": "8a1299898f963daa018fa5758ade4c10",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-05616014",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": "PRPC-00000280",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 6,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-05-23",
          "effectiveEndDate": "2025-11-23",
          "processedThroughDate": "2025-09-23",
          "chargedThroughDate": "2025-10-23",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.0,
          "dmrc": 0.0,
          "tcv": 180.0,
          "dtcv": -180.0,
          "originalOrderDate": "2024-05-23",
          "amendedByOrderOn": "2025-10-21",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 10.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP10",
          "price": 10.0,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8a128d8c99f14124019a0932488a6edc",
          "originalChargeId": "8a1299898f963daa018fa5758add4c0f",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-05616013",
          "name": "Contribution",
          "productRatePlanChargeNumber": "PRPC-00000281",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 6,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-05-23",
          "effectiveEndDate": "2025-11-23",
          "processedThroughDate": "2025-09-23",
          "chargedThroughDate": "2025-10-23",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-05-23",
          "amendedByOrderOn": "2025-10-21",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128d8c99f14124019a093248f06ee6",
      "lastChangeType": "Add",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": "PRP-00000180",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-07025123",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128d8c99f14124019a093248666ecd",
          "originalChargeId": "8a128d8c99f14124019a093248666ecd",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-07370729",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": "PRPC-00000280",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-11-23",
          "effectiveEndDate": "2027-05-23",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": "2025-11-23",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 12.0,
          "dmrc": 12.0,
          "tcv": 216.0,
          "dtcv": 216.0,
          "originalOrderDate": "2025-10-21",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 12.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP12",
          "price": 12.0,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8a128d8c99f14124019a093248666ecc",
          "originalChargeId": "8a128d8c99f14124019a093248666ecc",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-07370728",
          "name": "Contribution",
          "productRatePlanChargeNumber": "PRPC-00000281",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-09-23",
          "effectiveEndDate": "2027-05-23",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": "2025-09-23",
          "triggerEvent": "SpecificDate",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2025-10-21",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-05199839",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2021-09-28",
      "endDate": "2027-05-23",
      "status": "Active"
    },
    {
      "startDate": "2027-05-23",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-10-22 00:54:41",
  "updateTime": "2025-10-22 00:54:41",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
